&НаСервере
Функция СформироватьУпаковочныйЛист()
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПФ_УпаковочныйЛист_дляПЭ");
	Область = Макет.ПолучитьОбласть("Область");
	//Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ЗаполнитьЗначенияСвойств(Область.Параметры, ДокументСсылка);
	//ТабДок.Вывести(Область);
	//Область = Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, Область, ДокументСсылка);
	//ТабДок.Вывести(Область);
	//Область = Макет.ПолучитьОбласть("ОбластьПодвал");
	//ЗаполнитьЗначенияСвойств(Область.Параметры, ДокументСсылка);
	//ТабДок.Вывести(Область);
	//Область = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	ТабДок.Вывести(Область);
	Возврат ТабДок;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Количество = 1;
	ДокументСсылка = Параметры.ДокументСсылка;
	СформироватьПечатныйДокумент()
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатныйДокумент()
	ТабличныйДокумент.Очистить();
	//ТабДок = Новый ТабличныйДокумент;
	Для Счетчик = 1 По Количество Цикл
		ТабличныйДокумент.Вывести(СформироватьУпаковочныйЛист());
		//Если Счетчик%2 Тогда
		//	ТабДок.Вывести(СформироватьУпаковочныйЛист());
		//Иначе
		//	ТабДок.Присоединить(СформироватьУпаковочныйЛист());
		//	ТабличныйДокумент.Вывести(ТабДок);
		//	ТабДок.Очистить();
		//КонецЕсли;
		//Если Счетчик%6 = 0 Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//ТабличныйДокумент.ВывестиВертикальныйРазделительСтраниц();
		//КонецЕсли; 
	КонецЦикла;
	//
	//Если Количество%2 Тогда
	//	ТабличныйДокумент.Вывести(ТабДок);
	//	//ТабличныйДокумент.ВывестиВертикальныйРазделительСтраниц();
	//КонецЕсли;
	//
	//Если Количество%6 Тогда
	//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	//ТабличныйДокумент.ВывестиВертикальныйРазделительСтраниц();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент);
	СформироватьПечатныйДокумент()	
КонецПроцедуры
