&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереданныйВПараметрахПартнер = Неопределено;
	Параметры.Свойство("Партнер", ПереданныйВПараметрахПартнер);
	
	Если ЗначениеЗаполнено(ПереданныйВПараметрахПартнер) Тогда
		УстановитьЗначениеЭлементаОтбора(СписокПлантаций, "Владелец", ПереданныйВПараметрахПартнер, 
			ВидСравненияКомпоновкиДанных.Равно, Истина)
	КонецЕсли;	
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	Если ЗначениеЗаполнено(ПереданныйВПараметрахПартнер) Тогда
//		УстановитьЗначениеЭлементаОтбора(СписокПлантаций, "Владелец", ПереданныйВПараметрахПартнер, 
//			ВидСравненияКомпоновкиДанных.Равно, Истина)
//	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(Элементы.СписокПлантаций.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПлантацийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(Элементы.СписокПлантаций.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПлантацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеЭлементаОтбора(Знач ДинамСписок, ИмяЭлементаОтбора, ЗначениеЭлементаОтбора, 
	ВидСравниия = Неопределено, Использование = Истина)
	
	Если ВидСравниия = Неопределено Тогда
		ВидСравниия = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;	
	
	ЭлементОтбора = Неопределено;
	Для Каждого Элемент Из ДинамСписок.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Строка(Элемент.ЛевоеЗначение) = ИмяЭлементаОтбора Тогда
			ЭлементОтбора = Элемент;
			Прервать; 		
		КонецЕсли;	
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = ДинамСписок.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ДоступноеПолеОтбораПоНаименованию = НайтиДоступноеПолеОтбораПоНаименованию(ИмяЭлементаОтбора, ДинамСписок);
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяЭлементаОтбора);
		ЭлементОтбора.ЛевоеЗначение  = ДоступноеПолеОтбораПоНаименованию;
	КонецЕсли;	
	
	ЭлементОтбора.ВидСравнения   = ВидСравниия;
	ЭлементОтбора.Использование  = Использование;
	ЭлементОтбора.ПравоеЗначение = ЗначениеЭлементаОтбора;
	
КонецПроцедуры

&НаСервере
Функция НайтиДоступноеПолеОтбораПоНаименованию(ИмяЭлементаОтбора, ДинамСписок)
	
	Для Каждого ДоступноеПолеОтбора Из ДинамСписок.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		
		Если Строка(ДоступноеПолеОтбора.Поле) = ИмяЭлементаОтбора Тогда
			
			Возврат ДоступноеПолеОтбора.Поле;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции


