&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОпрделитьГруппуПромежуточныхСкладов(Отказ);
КонецПроцедуры

&НаСервере
Процедура ОпрделитьГруппуПромежуточныхСкладов(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	Склады.Код = ""00093""
	               |	И Склады.ЭтоГруппа = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГруппаПромежуточныхСкладов = Выборка.Ссылка;	
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьДокументы(Команда)
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(СкладПромежуточный) Тогда
		ПараметрыОткрытия.Вставить("СкладОтправитель",   СкладОтправитель);
		ПараметрыОткрытия.Вставить("СкладПолучатель",    СкладПромежуточный);
	Иначе
		ПараметрыОткрытия.Вставить("СкладОтправитель",   СкладОтправитель);
		ПараметрыОткрытия.Вставить("СкладПолучатель",    СкладПолучатель);
	КонецЕсли;
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", ПараметрыОткрытия);
	//Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПроверитьИспользованиеПромежуточногоСклада();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА Склады.Родитель.Код = ""00092""
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ИспользоватьПромежуточныйСклад,
	               |	ВЫБОР
	               |		КОГДА Склады.Родитель.Код = ""00093""
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоПромежуточныйСклад
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	Склады.ЭтоГруппа = ЛОЖЬ
	               |	И Склады.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СкладПолучатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИспользоватьПромежуточныйСклад = Выборка.ИспользоватьПромежуточныйСклад;
		ПопыткаВыбораПромежуточногоСклада = Выборка.ЭтоПромежуточныйСклад;
		Если ПопыткаВыбораПромежуточногоСклада Тогда
			СкладПромежуточный = СкладПолучатель;
			СкладПолучатель = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	//ПроверитьИспользованиеПромежуточногоСклада();
	//Элементы.СкладПромежуточный.Видимость = ИспользоватьПромежуточныйСклад ИЛИ ПопыткаВыбораПромежуточногоСклада;
	//Элементы.ДекорацияПромежуточный.Видимость = ИспользоватьПромежуточныйСклад ИЛИ ПопыткаВыбораПромежуточногоСклада;
	ОпределитьПромежуточныйСкладКлиент()
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПромежуточныйСкладКлиент()
	ОпределитьПромежуточныйСкладСервер();
	ИспользоватьПромежуточныйСклад = ЗначениеЗаполнено(СкладПромежуточный);
	Элементы.СкладПромежуточный.Видимость = ИспользоватьПромежуточныйСклад;
	Элементы.ДекорацияПромежуточный.Видимость = ИспользоватьПромежуточныйСклад;
КонецПроцедуры

&НаСервере
Процедура ОпределитьПромежуточныйСкладСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАБС_СоответствияСкладов.СкладОтправитель КАК СкладОтправитель,
	               |	КАБС_СоответствияСкладов.СкладПолучатель КАК СкладПолучатель,
	               |	КАБС_СоответствияСкладов.СкладПромежуточный КАК СкладПромежуточный
	               |ИЗ
	               |	РегистрСведений.КАБС_СоответствияСкладов КАК КАБС_СоответствияСкладов
	               |ГДЕ
	               |	КАБС_СоответствияСкладов.СкладОтправитель = &СкладОтправитель
	               |	И КАБС_СоответствияСкладов.СкладПолучатель = &СкладПолучатель
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КАБС_СоответствияСкладов.СкладОтправитель,
	               |	КАБС_СоответствияСкладов.СкладПолучатель,
	               |	КАБС_СоответствияСкладов.СкладПромежуточный
	               |ИЗ
	               |	РегистрСведений.КАБС_СоответствияСкладов КАК КАБС_СоответствияСкладов
	               |ГДЕ
	               |	КАБС_СоответствияСкладов.СкладОтправитель = &СкладОтправитель
	               |	И КАБС_СоответствияСкладов.СкладПромежуточный = &СкладПолучатель
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КАБС_СоответствияСкладов.СкладОтправитель,
	               |	КАБС_СоответствияСкладов.СкладПолучатель,
	               |	КАБС_СоответствияСкладов.СкладПромежуточный
	               |ИЗ
	               |	РегистрСведений.КАБС_СоответствияСкладов КАК КАБС_СоответствияСкладов
	               |ГДЕ
	               |	КАБС_СоответствияСкладов.СкладПромежуточный = &СкладОтправитель
	               |	И КАБС_СоответствияСкладов.СкладПолучатель = &СкладПолучатель";
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СкладОтправитель   = Выборка.СкладОтправитель;
		СкладПолучатель    = Выборка.СкладПолучатель;
		СкладПромежуточный = Выборка.СкладПромежуточный;
	Иначе
		СкладПромежуточный = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	ОпределитьПромежуточныйСкладКлиент()
КонецПроцедуры
